wmsmobile/src/Documents/итНаборка/итНаборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итНаборка</name>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>155</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FSRARID</name>
    <comment>ид для печати SSCC</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйПризнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНаборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихКодыЯчеекДокумента</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wmsmobile/src/InformationRegisters/итЗадачиКРаспределениюДополнительныеДанные/итЗадачиКРаспределениюДополнительныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итЗадачиКРаспределениюДополнительныеДанные</name>
  <attributes>
    <name>Реквизит1Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит2Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит3Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1Число</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит2Число</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит3Число</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит2Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит3Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит2Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит3Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит2ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит3ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

wmsmobile/src/InformationRegisters/итЗадачиКРаспределению/итЗадачиКРаспределению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итЗадачиКРаспределению</name>
  <resources>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДокументОснованиеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.итWMSСостоянияЗадачТСД</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

wmsmobile/src/Documents/итНаборка/Forms/ФормаВыбораДействияМаршрут/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МаршрутГУИД") Тогда 
		ИдМаршрута=Параметры.МаршрутГУИД;
	КонецЕсли;
	Если Параметры.Свойство("Маршрут") Тогда 
		ПредставлениеМаршрута=Параметры.Маршрут;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПринятьМаршрутНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итЗадачиКРаспределениюДополнительныеДанные.ИдЗадачи КАК ИдЗадачи
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.итЗадачиКРаспределениюДополнительныеДанные КАК итЗадачиКРаспределениюДополнительныеДанные
		|ГДЕ
		|	итЗадачиКРаспределениюДополнительныеДанные.Реквизит1ГУИД = &ИдМаршрута
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итЗадачиКРаспределению.ДокументОснование КАК ДокументОснование,
		|	МАКСИМУМ(итЗадачиКРаспределению.ИдЗадачи) КАК ИдЗадачи,
		|	итЗадачиКРаспределению.ТипЗадачи КАК ТипЗадачи
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итЗадачиКРаспределению КАК итЗадачиКРаспределению
		|		ПО ВТ.ИдЗадачи = итЗадачиКРаспределению.ИдЗадачи
		|
		|СГРУППИРОВАТЬ ПО
		|	итЗадачиКРаспределению.ДокументОснование,
		|	итЗадачиКРаспределению.ТипЗадачи";
	
	Запрос.УстановитьПараметр("ИдМаршрута", ИдМаршрута);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//СлужебныеФункцииИПроцедурыКлиентСервер.ДобавитьВЛог(ВыборкаДетальныеЗаписи.ИдЗадачи,"#НаборкаВыбораДействияМаршрут Взятие наборки на сервере",ВыборкаДетальныеЗаписи.ДокументОснование);		
		СтруктураДанных=новый Структура;
		СлужебныеФункцииИПроцедурыКлиентСервер.СформироватьСтруктуруДанныхОПользователе(СтруктураДанных);
		СтруктураДанных.Вставить("ТипПолученияДанных","Документ");
		СтруктураДанных.Вставить("КлючПолученияДанных",ВыборкаДетальныеЗаписи.ИдЗадачи);
		СтруктураДанных.Вставить("ТипЗадачи",ВыборкаДетальныеЗаписи.ТипЗадачи);
		СтруктураДанных=ОбработчикиЗапросаСервера.ЗапроситьДанные(СтруктураДанных,"DataRegistrationAndDonload");
		Если СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных)тогда
			Возврат
		КонецЕсли;
		//СлужебныеФункцииИПроцедурыКлиентСервер.ДобавитьВЛог(ВыборкаДетальныеЗаписи.ИдЗадачи,"#НаборкаВыбораДействияМаршрут Пришёл ответ по наборке с сервера,начало обработки на тсд",ВыборкаДетальныеЗаписи.ДокументОснование);	
		МодульРаспределенияДанных.ОбработчикВходящихДанных(СтруктураДанных);
		//СлужебныеФункцииИПроцедурыКлиентСервер.ДобавитьВЛог(ВыборкаДетальныеЗаписи.ИдЗадачи,"#НаборкаВыбораДействияМаршрут Обработан на тсд",ВыборкаДетальныеЗаписи.ДокументОснование);	
	КонецЦикла;
	


КонецПроцедуры

&НаКлиенте
Процедура ПринятьМаршрут(Команда)
	ПринятьМаршрутНаСервере();
	ОткрытьФорму("Обработка.ДиспетчерЗадач.Форма.ЗадачиНаТСДПоРазделам",,ЭтаФорма.ВладелецФормы);
	ТригерПриемаСканераШтрихКода=Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры
